ЭкзаменационнаяЗадача/src/Documents/ПродажаКниг/ПродажаКниг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаКниг</name>
  <registerRecords>AccumulationRegister.ОстаткиНомеклатуры</registerRecords>
  <registerRecords>AccumulationRegister.БронированиеТоваров</registerRecords>
  <registerRecords>AccumulationRegister.Выручка</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваСети</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокКниг</name>
    <attributes>
      <name>Книга</name>
      <type>
        <types>CatalogRef.Книги</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЭкзаменационнаяЗадача/src/AccumulationRegisters/БронированиеТоваров/БронированиеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>БронированиеТоваров</name>
  <resources>
    <name>КоличествоЗабронированного</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Книга</name>
    <type>
      <types>CatalogRef.Книги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ЭкзаменационнаяЗадача/src/AccumulationRegisters/ОстаткиНомеклатуры/ОстаткиНомеклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНомеклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Книга</name>
    <type>
      <types>CatalogRef.Книги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПоступлениеКниг</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ЭкзаменационнаяЗадача/src/Documents/ПродажаКниг/ManagerModule.bsl
// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ВыполнитьБронирование(ДокументСсылка) Экспорт
	
	Если Не ДоступностьБрони(ДокументСсылка) Тогда
		
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыНакопления.БронированиеТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
	
	Для каждого ТекСтрокаТовары Из ДокументСсылка.СписокКниг Цикл
		Движение = НаборЗаписей.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ДокументСсылка.Дата;
		Движение.Книга = ТекСтрокаТовары.Книга;
		Движение.Склад = ДокументСсылка.Склад;
		Движение.КоличествоЗабронированного = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	Сообщить("Бронирование выполнено успешно!");
	
КонецПроцедуры

Функция ДоступностьБрони(Ссылка)
	
	Забронировать = Истина;

	// Получение остатков из регистра (на момент времени документа)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажаКнигСписокКниг.Книга КАК Книга,
		|	СУММА(ПродажаКнигСписокКниг.Количество) КАК Количество1
		|ПОМЕСТИТЬ ВТ_ТоварыДокумента
		|ИЗ
		|	Документ.ПродажаКниг.СписокКниг КАК ПродажаКнигСписокКниг
		|ГДЕ
		|	ПродажаКнигСписокКниг.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажаКнигСписокКниг.Книга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиНомеклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиНомеклатурыОстатки.Книга КАК Книга1
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.ОстаткиНомеклатуры.Остатки(
		|			&Период,
		|			(Склад, Книга) В
		|				(ВЫБРАТЬ
		|					&Склад,
		|					ВТ_ТоварыДокумента.Книга КАК Книга
		|				ИЗ
		|					ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента)) КАК ОстаткиНомеклатурыОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БронированиеТоваровОстатки.Книга КАК Книга,
		|	БронированиеТоваровОстатки.КоличествоЗабронированногоОстаток КАК КоличествоЗабронированногоОстаток
		|ПОМЕСТИТЬ ВТ_Бронь
		|ИЗ
		|	РегистрНакопления.БронированиеТоваров.Остатки(
		|			&Период,
		|			(Склад, Книга) В
		|				(ВЫБРАТЬ
		|					&Склад,
		|					ВТ_ТоварыДокумента.Книга КАК Книга
		|				ИЗ
		|					ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента)) КАК БронированиеТоваровОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТоварыДокумента.Книга КАК Книга,
		|	ВТ_ТоварыДокумента.Количество1 КАК КоличествоДокумент,
		|	ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ_ТоварыДокумента.Книга) КАК КнигаПредставление,
		|	ЕСТЬNULL(ВТ_Бронь.КоличествоЗабронированногоОстаток, 0) КАК Поле1
		|ИЗ
		|	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
		|		ПО ВТ_ТоварыДокумента.Книга = ВТ_Остатки.Книга1
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Бронь КАК ВТ_Бронь
		|		ПО ВТ_ТоварыДокумента.Книга = ВТ_Бронь.Книга";
	
	Запрос.УстановитьПараметр("Период", Ссылка.Дата);
	Запрос.УстановитьПараметр("Склад", Ссылка.Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	// Проверка остатков
	Пока Выборка.Следующий() Цикл
		КоличествоОстатка = Выборка.КоличествоОстаток - Выборка.КоличествоЗабронированного;
		Если Выборка.КоличествоДокумент > КоличествоОстатка Тогда
			Забронировать = Ложь;
			Дефицит = Выборка.КоличествоДокумент - КоличествоОстатка;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Недостаточно товара " + Выборка.КнигаПредставление 
				+ " в количестве " + Дефицит + " шт";
			Сообщение.Сообщить();
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Забронировать;
	
КонецФункции


#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
